cmsis-svd/cmsis-svd/data/Spansion/MB9BF41xT.svd
        <!-- REGISTER "PDOR1" -->
        <register derivedFrom="DDR1">
          <name>PDOR1</name>
          <description>Port output data register 1</description>
          <addressOffset>0x404</addressOffset>
        </register>
        <!-- REGISTER "PDOR2" -->
        <register derivedFrom="DDR2">
          <name>PDOR2</name>
          <description>Port output data register 2</description>
          <addressOffset>0x408</addressOffset>
        </register>
        <!-- REGISTER "PDOR3" -->
        <register derivedFrom="DDR3">
          <name>PDOR3</name>
          <description>Port output data register 3</description>
          <addressOffset>0x40C</addressOffset>
        </register>
        <!-- REGISTER "PDOR4" -->
        <register derivedFrom="DDR4">
          <name>PDOR4</name>
          <description>Port output data register 4</description>
          <addressOffset>0x410</addressOffset>
        </register>
        <!-- REGISTER "PDOR5" -->
        <register derivedFrom="DDR5">
          <name>PDOR5</name>
          <description>Port output data register 5</description>
          <addressOffset>0x414</addressOffset>
        </register>
        <!-- REGISTER "PDOR6" -->
        <register derivedFrom="DDR6">
          <name>PDOR6</name>
          <description>Port output data register 6</description>
          <addressOffset>0x418</addressOffset>
        </register>
        <!-- REGISTER "PDOR7" -->
        <register derivedFrom="DDR7">
          <name>PDOR7</name>
          <description>Port output data register 7</description>
          <addressOffset>0x41C</addressOffset>
        </register>
        <!-- REGISTER "PDOR8" -->
        <register derivedFrom="DDR8">
          <name>PDOR8</name>
          <description>Port output data register 8</description>
          <addressOffset>0x420</addressOffset>
        </register>
        <!-- REGISTER "PDOR9" -->
        <register derivedFrom="DDR9">
          <name>PDOR9</name>
          <description>Port output data register 9</description>
          <addressOffset>0x424</addressOffset>
        </register>
        <!-- REGISTER "PDORA" -->
        <register derivedFrom="DDRA">
          <name>PDORA</name>
          <description>Port output data register A</description>
          <addressOffset>0x428</addressOffset>
        </register>
        <!-- REGISTER "PDORB" -->
        <register derivedFrom="DDRB">
          <name>PDORB</name>
          <description>Port output data register B</description>
          <addressOffset>0x42C</addressOffset>
        </register>
        <!-- REGISTER "PDORC" -->
        <register derivedFrom="DDRC">
          <name>PDORC</name>
          <description>Port output data register C</description>
          <addressOffset>0x430</addressOffset>
        </register>
        <!-- REGISTER "PDORD" -->
        <register derivedFrom="DDRD">
          <name>PDORD</name>
          <description>Port output data register D</description>
          <addressOffset>0x434</addressOffset>
        </register>
        <!-- REGISTER "PDORE" -->
        <register derivedFrom="DDRE">
          <name>PDORE</name>
          <description>Port output data register E</description>
          <addressOffset>0x438</addressOffset>
        </register>
        <!-- REGISTER "PDORF" -->
        <register derivedFrom="DDRF">
          <name>PDORF</name>
          <description>Port output data register F</description>
          <addressOffset>0x43C</addressOffset>
        </register>
        <!-- REGISTER "ADE" -->
        <register>
          <name>ADE</name>
          <description>Analog input setting register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN31" -->
            <field>
              <name>AN31</name>
              <description>Bit31 of ADE</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN30" -->
            <field>
              <name>AN30</name>
              <description>Bit30 of ADE</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN29" -->
            <field>
              <name>AN29</name>
              <description>Bit29 of ADE</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN28" -->
            <field>
              <name>AN28</name>
              <description>Bit28 of ADE</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN27" -->
            <field>
              <name>AN27</name>
              <description>Bit27 of ADE</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN26" -->
            <field>
              <name>AN26</name>
              <description>Bit26 of ADE</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN25" -->
            <field>
              <name>AN25</name>
              <description>Bit25 of ADE</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN24" -->
            <field>
              <name>AN24</name>
              <description>Bit24 of ADE</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN23" -->
            <field>
              <name>AN23</name>
              <description>Bit23 of ADE</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN22" -->
            <field>
              <name>AN22</name>
              <description>Bit22 of ADE</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN21" -->
            <field>
              <name>AN21</name>
              <description>Bit21 of ADE</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN20" -->
            <field>
              <name>AN20</name>
              <description>Bit20 of ADE</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN19" -->
            <field>
              <name>AN19</name>
              <description>Bit19 of ADE</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN18" -->
            <field>
              <name>AN18</name>
              <description>Bit18 of ADE</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN17" -->
            <field>
              <name>AN17</name>
              <description>Bit17 of ADE</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN16" -->
            <field>
              <name>AN16</name>
              <description>Bit16 of ADE</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN15" -->
            <field>
              <name>AN15</name>
              <description>Bit15 of ADE</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN14" -->
            <field>
              <name>AN14</name>
              <description>Bit14 of ADE</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN13" -->
            <field>
              <name>AN13</name>
              <description>Bit13 of ADE</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN12" -->
            <field>
              <name>AN12</name>
              <description>Bit12 of ADE</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN11" -->
            <field>
              <name>AN11</name>
              <description>Bit11 of ADE</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN10" -->
            <field>
              <name>AN10</name>
              <description>Bit10 of ADE</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN9" -->
            <field>
              <name>AN9</name>
              <description>Bit9 of ADE</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN8" -->
            <field>
              <name>AN8</name>
              <description>Bit8 of ADE</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN7" -->
            <field>
              <name>AN7</name>
              <description>Bit7 of ADE</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN6" -->
            <field>
              <name>AN6</name>
              <description>Bit6 of ADE</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN5" -->
            <field>
              <name>AN5</name>
              <description>Bit5 of ADE</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN4" -->
            <field>
              <name>AN4</name>
              <description>Bit4 of ADE</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN3" -->
            <field>
              <name>AN3</name>
              <description>Bit3 of ADE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN2" -->
            <field>
              <name>AN2</name>
              <description>Bit2 of ADE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN1" -->
            <field>
              <name>AN1</name>
              <description>Bit1 of ADE</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN0" -->
            <field>
              <name>AN0</name>
              <description>Bit0 of ADE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
